{"type":"data","nodes":[null,null,{"type":"data","data":[{"article":1,"content":12},{"id":2,"slug":3,"markdown":4,"image":5,"imageAlt":6,"title":7,"description":8,"time_to_read":9,"difficulty":10,"stepped_guide_available":11},352401,"terms-of-service","security-and-privacy/terms-of-service.md","/articles/cover/terms-of-service.png","Placeholder image","Conditions générales d'utilisation","Les Conditions générales d’utilisation définissent les règles et obligations applicables lors de l’utilisation des services Papillon.",5,"Non spécifié",false,"# 1 - Services concernés\nLes services concernés par ces conditions générales d'utilisation incluent :\n\n- **L’application mobile Papillon** dont le code source est disponible sur l’outils GitHub à l’adresse « [https://github.com/PapillonApp/papillon](https://github.com/PapillonApp/papillon) »\n- **Le site web de présentation** disponible à l’adresse « [https://www.papillon.bzh](https://www.papillon.bzh) »\n\n# 2. - Conditions\n\n> Papillon est un logiciel open source distribué sous licence GPL-v3.0.\n\n* Papillon est un client de vie scolaire libre, gratuit, indépendant, collobratif, open source, et aucunement affilié à une quelconque entreprise.\n* L'application \"Papillon\" est un logiciel conçu pour permettre l'accès aux données des services scolaires transmises par l'intermédiaire de librairies tierces. Papillon n'est pas responsable de la manière dont les données sont transmises par ces librairies tierces, ni du fonctionnement de ces dernières, du moment que leurs licences et déclarations de confidentialité sont conformes avec celles de Papillon.\n* Aucune personne ou logiciel automatisé n’utilise ou ne collecte vos données personnelles.\n* Vos données, aussi bien scolaires que personnelles, ne sont transmises qu'aux serveurs officiels des services de vie scolaire via leurs APIs, conformément à [la politique de confidentialité.](/articles/352402-privacy-policy). Papillon n'est pas responsable de la sécurité de ces données conservées localement sur votre appareil.\n* Certains logs de débogage anonymisés et d'autres crash reports (ne contenant aucune donnée personnelle ou scolaire) peuvent être envoyés à l'équipe de développement pour améliorer le fonctionnement du logiciel.\n* La suppression de l'application ou sa déconnexion entraînera la suppression de toutes les données stockées localement. Vous pouvez accéder à ses données via le menu de développement (LocalStorage).\n* Vous avez le droit d'utiliser, de modifier de redistribuer, et de partager Papillon sous les termes de la licence GPL-v3.0.\n* Papillon ou l'une de ses fonctionnalités peut être retirée de la distribution à tout moment sans préavis par le gestionnaire du service.\n* Papillon n'a aucun lien avec aucune entité scolaire ou éducative.\n\nVous pouvez consulter la licence complète [sur notre dépôt GitHub](https://github.com/PapillonApp/Papillon/blob/stable/LICENSE).\n\nSi vous n'acceptez pas ou plus ces conditions, vous pouvez ne pas utiliser et/ou désinstaller Papillon. Aucune donnée ne sera conservée sur votre appareil.\n\n# 3. - En cas de problème\n\nEn cas de problème avec son traitement des données, merci de nous contacter à l'adresse suivante : [contact@vincelinise.com](mailto:contact@vincelinise.com).\n\n> #### 🛟 Un problème avec l'application ?\n> Pour un problème **concernant l'application** (ex. connexion impossible, bugs, crashs etc..), référez vous au support : [support@papillon.bzh](mailto:support@papillon.bzh) ou contactez-nous sur les réseaux sociaux du projet."],"uses":{"params":["slug"]}}]}
