{"type":"data","nodes":[null,null,{"type":"data","data":[{"article":1,"content":12},{"id":2,"slug":3,"markdown":4,"image":5,"imageAlt":6,"title":7,"description":8,"time_to_read":9,"difficulty":10,"stepped_guide_available":11},352402,"privacy-policy","security-and-privacy/privacy-policy.md","/articles/cover/privacy-policy.png","Placeholder image","Politique de confidentialité","Par souci de transparence, une politique de confidentialité claire et précise détaille ce que Papillon fait de vos données personnelles.",5,"Non spécifié",false,"\u003Cbr>\n\n> #### ✅ En bref\n> Papillon ne conserve ni n'envoie aucune donnée personnelle ou scolaire sur des serveurs externes à l'établissement de l'élève sans son consentement explicite.\n\n# 1 - Services concernés\n\nLes services concernés par cette politique de confidentialité incluent, mais ne se limitent pas à :\n\n- **L’application mobile Papillon** dont le code source est disponible sur l’outils GitHub à l’adresse « [https://github.com/PapillonApp/papillon](https://github.com/PapillonApp/papillon) »\n- **Le site web de présentation** disponible à l’adresse « [https://www.papillon.bzh](https://www.papillon.bzh) »\n- **Le site de documentation support** disponible à l’adresse « [https://support.papillon.bzh](https://support.papillon.bzh) »\n- **Le site de documentation développeur** disponible à l’adresse « [https://docs.papillon.bzh](https://docs.papillon.bzh) »\n\nCes services peuvent recueillir des données personnelles spécifiques à leurs utilisateurs comme décrit dans la suite de ce document.\n\n# 2 - Quelles données sont collectées ?\n\n## 2.1 - Données collectées\n\nLes données personnelles peuvent être collectées via différentes méthodes et pour diverses raisons au sein de notre service. Chacune de ces méthodes a été mise en place dans le respect total de votre vie privée, en veillant à ce que seules les données nécessaires soient collectées pour le fonctionnement optimal de nos services.\n\n### 2.1.1 - L’application mobile Papillon\n\nL’application mobile Papillon collecte des informations comme :\n\n**Vos données d’identification à votre service scolaire**\n\n- Identifiants de connexion au service scolaire.\n- URL de l'établissement ou académie correspondante dans le cas *échéant.*\n\nCes données d'identification **ne sont pas stockées en dehors de votre appareil** et sont utilisées **uniquement** pour vous identifier à vos services scolaire.\n\n**Vos données scolaires**\n\n- Emploi du temps\n- Travail à faire\n- Notes\n- Compétences\n- Actualités de l'établissement\n- Conversations\n- Événements de vie scolaire\n- Autre information scolaire en fonction du services scolaires utilisé.\n\nCes données sont renvoyées par les services de vie scolaire correspondants. **Ces données ne quitte jamais votre appareil** et vous seul y avez accès.\n\n**Vos données d’identification à votre service de restauration**\n\n- Identifiants de connexion au service de restauration.\n- URL du services de restauration.\n\nCes données d'identification **ne sont pas stockées en dehors de votre appareil** et sont utilisées **uniquement** pour vous identifier à vos services de restauration.\n\n**Vos données de restauration**\n\n- Menu\n- Réservation\n- Information concernant la carte du services scolaire\n\nCes données sont renvoyées par les services de vie scolaire correspondants. **Ces données ne quitte jamais votre appareil** et vous seul y avez accès.\n\n### 2.1.2 - Le site web de présentation\n\nNous tenons à informer nos utilisateurs que le site web de présentation https://www.papillon.bzh respecte pleinement la vie privée de chacun. Aucune donnée personnelle ou information concernant l'utilisateur et son appareil n'est collectée lors de la visite du site.\n\nDe plus, nous ne conservons aucun cookie, il n'y a pas de logs de visite enregistrés et nous n'utilisons aucun outil d'analyse pour suivre le comportement des utilisateurs. Notre engagement envers la protection de votre vie privée est total et transparent.\n\nVeuillez noter que, [conformément aux pratiques de notre hébergeur GitHub Pages](https://docs.github.com/fr/pages/getting-started-with-github-pages/about-github-pages?utm_source=chatgpt.com), l’adresse IP des visiteurs est enregistrée à des fins de sécurité.\n\n### 2.1.2 - **Le site de documentation support**\n\nLe site https://support.papillon.bzh respecte pleinement la vie privée de chacun. Aucune donnée personnelle ou information concernant l'utilisateur et son appareil n'est collectée lors de la visite sur celui-ci.\n\nLe site ne conserve aucun cookie, aucun logs de visite n’est enregistrés et nous n'utilisons aucun outil d'analyse pour suivre le comportement des utilisateurs. Notre engagement envers la protection de votre vie privée est total et transparent.\n\nVeuillez noter que, [conformément aux pratiques de notre hébergeur GitHub Pages](https://docs.github.com/fr/pages/getting-started-with-github-pages/about-github-pages?utm_source=chatgpt.com), l’adresse IP des visiteurs est enregistrée à des fins de sécurité.\n\nNotre engagement envers la protection de votre vie privée est total et transparent.\n\n### 2.1.3 - **Le site de documentation développeur**\n\nLe site de documentation développeur ne collecte pas activement des données personnelles. Toutefois, des données anonymes pourraient être utilisées pour mesurer l'engagement et l'utilisation des ressources fournies, afin d'améliorer continuellement le contenu. Cela inclut:\n\n- Le nombre de visites par page\n- La durée moyenne de la visite\n- Le type de dispositif utilisé pour accéder\n\nCette documentation est hébergée sur le service en ligne https://www.gitbook.com. Sa [politique de confidentialité](https://policies.gitbook.com/privacy-and-security/statement/cookies) s'applique.\n\n### 2.1.4 - **Logs et crash reports**\n\n> #### ⚠️ Avertissement\n> Conformément à notre engagement envers la protection de la vie privée, **aucun log d'activité ou de données personnelles n'est enregistré sur nos services et applications**. Cette politique garantit une confidentialité totale de l'utilisation de nos outils par les utilisateurs.\n\nBien que nous ne collectons ni ne stockons de données personnelles dans nos systèmes, des rapports d'erreurs ou *crash reports* peuvent être remontés par le système d'exploitation. Ces rapports contiennent uniquement des informations anonymisées concernant l'état du système au moment de l'erreur. Ces informations sont utilisées exclusivement pour l'amélioration de nos services et ne sont en aucun cas liées à votre identité ou à vos données personnelles.\n\nPour garantir et respecter la vie privée de nos utilisateurs, aucune information liée à l'identité de l'utilisateur ni aucune donnée scolaire (telles que les notes, l'emploi du temps, etc.) n'est collectée ou stockée par nos systèmes. Notre engagement dans la protection de votre vie privée s'étend à toutes les fonctionnalités de notre application, assurant ainsi une expérience sécurisée et confidentielle.\n\n## **2.2 - Données liées à l'identité**\n\nNous tenons à souligner que **nous ne conservons aucune donnée liée à l'identité de nos utilisateurs**. Cette mesure s'inscrit dans notre politique stricte de protection de la vie privée, garantissant ainsi que toutes les interactions avec nos services préservent l'anonymat et la confidentialité.\n\n## **2.3 - Accès extérieur aux données**\n\nAucune personne ou logiciel automatisé n’utilise, ne traite ou ne collecte vos données personnelles.\n\n## **2.4 - Suppression des données**\n\nLa suppression de l'application entraîne immédiatement la suppression de l'intégralité des données stockées sur votre appareil. Nous ne conservons aucune copie de vos données après la suppression de l'application, assurant ainsi une maîtrise totale de vos informations personnelles.\n\n### 2.5 - RGPD\n\nConformément au Règlement Général sur la Protection des Données, et notamment la loi n° 2018-493 du 20 juin 2018 relative à la protection des données personnelles, vous disposez d'un droit de rectification, de suppression et de consultation concernant vos données personnelles collectées lors de votre visite sur le site [https://papillon.bzh](https://papillon.bzh). Pour toute demande, adressez un courriel au responsable de traitement via l'adresse : [contact@vincelinise.com](mailto:contact@vincelinise.com).\n\n### 2.6 - Comparaison avec l'application PRONOTE officielle\n\nVoici un schéma comparant le fonctionnement de Papillon et de l'application PRONOTE officielle, on voit ici que son fonctionnement est proche de celui de la version officielle ; en effet, Papillon ne sert que d'intermédiaire entre l'utilisateur et les serveurs officiels de PRONOTE, ne faisant que transmettre des données entre les deux, sans intermédiaire.\n\n![schema comparatif](/articles/assets/352402/papillon_pronote_comp.png)\n\n# 3 - Application mobile Papillon\n\nL’Application mobile Papillon est un logiciel **open source**, **gratuit**, **libre** et à but **non lucratif**. Conçu avec l'objectif principal de fournir un accès simplifié aux données essentielles des services scolaires. Il agit comme une interface entre l'utilisateur et les nombreuses données transmises par des librairies tierces. L'application s'engage à maintenir une totale transparence sur ses méthodes de fonctionnement et sur l'utilisation des données. En se basant sur des principes de développement collaboratifs, Papillon invite la communauté à participer à son évolution en contribuant au code, en proposant des améliorations ou en signalant des bugs, pour s'assurer que le logiciel reste à jour et réponde au mieux aux besoins de ses utilisateurs.\n\n## 3.1 - Sécurité des données\n\nLa sécurité et la transparence dans le traitement des données des utilisateurs sont d'une importance primordiale pour nous. Nous nous engageons fermement à adopter des mesures de sécurité robustes pour protéger les données contre les accès non autorisés, les modifications, les divulgations ou les destructions inappropriées. De plus, nous nous assurons de communiquer de manière transparente sur les pratiques de collecte, d'utilisation et de partage des données, permettant ainsi à nos utilisateurs de comprendre clairement comment leurs informations sont gérées.\n\n## 3.2 - Récupération des données et services open-source\n\nL'approche open source de Papillon est au cœur de notre stratégie de sécurisation des données. En rendant notre code accessible à tous, nous permettons à une communauté mondiale de contributeurs de le vérifier, de l'améliorer et d'identifier d'éventuelles failles de sécurité. Cette collaboration continue garantit que l'application ne se contente pas de respecter les normes actuelles de sécurité, mais qu'elle est également constamment mise à jour grâce aux contributions régulières de la communauté. Cette démarche participative assure une transparence totale et contribue à renforcer la confiance de nos utilisateurs dans la protection de leurs données.\n\n## 3.3 - Accès aux données via API publiques\n\nNotre politique d’accès aux données est strictement limitée à celles mises à disposition par les API publiques des services scolaires, de la même manière que l’application officielle de ces services. Papillon **s'engage à ne recourir à aucun moyen détourné** pour accéder aux données de ces services. Cette approche garantit que l'utilisation des données reste conforme à la politique de confidentialité des services scolaires concernés, tout en respectant les droits et la vie privée de nos utilisateurs.\n\n# 4 - Modification de la politique de confidentialité\n\nNous nous engageons à ne pas collecter de données à l'avenir, afin de préserver la confidentialité et l'intégrité des informations de nos utilisateurs. Cet engagement reflète notre volonté de construire une relation de confiance durable avec notre communauté.\n\n### 4.2 Mise à jour de la politique de confidentialité\n\nPapillon se réserve le droit de mettre à jour cette politique de confidentialité à tout moment. Dans ce cas, l'utilisateur peut être amené à être notifié.\n\n# 5 - En résumé\n\n- Les données collectées ne quittent jamais votre appareil et ne sont pas stockées par nos serveurs.\n- Nos sites web n’utilisent pas de cookies ni d’outils de suivi.\n- GitHub Pages peut enregistrer l’adresse IP des visiteurs pour des raisons de sécurité.\n\n# 6 - En cas de problème\n\nEn cas de problème avec le traitement des données, merci de nous contacter à l'adresse suivante : [contact@vincelinise.com](mailto:contact@vincelinise.com).\n\n> #### 🛟 Un problème avec l'application ?\n> Pour un problème **concernant l'application** (ex. connexion impossible, bugs, crashs etc..), référez vous au support : [support@papillon.bzh](mailto:support@papillon.bzh) ou contactez-nous sur les réseaux sociaux du projet."],"uses":{"params":["slug"]}}]}
